test-report/performance-summary.txt
     ✗ mqtt publish status is 200
      ↳  0% — ✓ 0 / ✗ 8
     ✓ mqtt publish response time OK
     ✓ get channels response time OK
     ✓ get channels status check
     ✓ create channel response time OK
     ✓ create channel status check
     ✓ health check status is 200
     ✓ health check response time OK
     ✓ get users status is 200
     ✓ get users response time OK
     ✓ create user status is 200 or 201
     ✓ create user response time OK
     ✓ get specific user response time OK

     checks.........................: 93.22%  ✓ 110      ✗ 8  
     data_received..................: 25 kB   1.5 kB/s
     data_sent......................: 8.2 kB  478 B/s
   ✗ endpoint_hits..................: 64      3.751166/s
     endpoint_response_time.........: avg=2.3125  min=0        med=2      max=9      p(90)=4.7     p(95)=8.7     
   ✗ errors.........................: 100.00% ✓ 8        ✗ 0  
     failed_requests................: 8       0.468896/s
     http_req_blocked...............: avg=31.49µs min=2µs      med=8µs    max=910µs  p(90)=32µs    p(95)=112.79µs
     http_req_connecting............: avg=8.19µs  min=0s       med=0s     max=173µs  p(90)=0s      p(95)=73.59µs 
   ✓ http_req_duration..............: avg=2.06ms  min=434µs    med=1.3ms  max=8.26ms p(90)=4.35ms  p(95)=7.87ms  
       { expected_response:true }...: avg=1.75ms  min=434µs    med=1.24ms max=8.26ms p(90)=3ms     p(95)=4.84ms  
   ✗ http_req_failed................: 12.30%  ✓ 8        ✗ 57 
     http_req_receiving.............: avg=80.23µs min=15µs     med=69µs   max=526µs  p(90)=144.4µs p(95)=158.39µs
     http_req_sending...............: avg=48.78µs min=8µs      med=30µs   max=702µs  p(90)=55.2µs  p(95)=62.8µs  
     http_req_tls_handshaking.......: avg=0s      min=0s       med=0s     max=0s     p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=1.93ms  min=406µs    med=1.19ms max=8.19ms p(90)=3.96ms  p(95)=7.66ms  
     http_reqs......................: 65      3.809778/s
     iteration_duration.............: avg=1.34s   min=512.19ms med=1.23s  max=2.49s  p(90)=2.02s   p(95)=2.25s   
     iterations.....................: 35      2.051419/s
   ✗ successful_requests............: 56      3.28227/s
     vus............................: 1       min=1      max=3
     vus_max........................: 3       min=3      max=3